Revit 2026 API

# AreaLoadForceVector3 Property

---

The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ForceVector3 { get; set; }
```
```vb
Public Property ForceVector3 As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ ForceVector3 {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member ForceVector3 : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The default force unit is kN/m^2 for metric, and ksf for imperial. Use UnitUtils class methods to convert value from or to internal units.

#### Reference

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace